luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxPsi5s_regdef.h
/**
 * \file IfxPsi5s_regdef.h
 * \brief
 * \copyright Copyright (c) 2016 Infineon Technologies AG. All rights reserved.
 *
 * Version: TC27XC_UM_V2.2.R1
 * Specification: tc27xC_um_v2.2_SFR.xml (Revision: UM_V2.2)
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Psi5s Psi5s
 * \ingroup IfxLld
 * 
 * \defgroup IfxLld_Psi5s_Bitfields Bitfields
 * \ingroup IfxLld_Psi5s
 * 
 * \defgroup IfxLld_Psi5s_union Union
 * \ingroup IfxLld_Psi5s
 * 
 * \defgroup IfxLld_Psi5s_struct Struct
 * \ingroup IfxLld_Psi5s
 * 
 */
#ifndef IFXPSI5S_REGDEF_H
#define IFXPSI5S_REGDEF_H 1
/******************************************************************************/
#include "Ifx_TypesReg.h"
/******************************************************************************/
/** \addtogroup IfxLld_Psi5s_Bitfields
 * \{  */

/** \brief  Access Enable Register 0 */
typedef struct _Ifx_PSI5S_ACCEN0_Bits
{
    unsigned int EN0:1;                     /**< \brief [0:0] Access Enable for Master TAG ID 0 (rw) */
    unsigned int EN1:1;                     /**< \brief [1:1] Access Enable for Master TAG ID 1 (rw) */
    unsigned int EN2:1;                     /**< \brief [2:2] Access Enable for Master TAG ID 2 (rw) */
    unsigned int EN3:1;                     /**< \brief [3:3] Access Enable for Master TAG ID 3 (rw) */
    unsigned int EN4:1;                     /**< \brief [4:4] Access Enable for Master TAG ID 4 (rw) */
    unsigned int EN5:1;                     /**< \brief [5:5] Access Enable for Master TAG ID 5 (rw) */
    unsigned int EN6:1;                     /**< \brief [6:6] Access Enable for Master TAG ID 6 (rw) */
    unsigned int EN7:1;                     /**< \brief [7:7] Access Enable for Master TAG ID 7 (rw) */
    unsigned int EN8:1;                     /**< \brief [8:8] Access Enable for Master TAG ID 8 (rw) */
    unsigned int EN9:1;                     /**< \brief [9:9] Access Enable for Master TAG ID 9 (rw) */
    unsigned int EN10:1;                    /**< \brief [10:10] Access Enable for Master TAG ID 10 (rw) */
    unsigned int EN11:1;                    /**< \brief [11:11] Access Enable for Master TAG ID 11 (rw) */
    unsigned int EN12:1;                    /**< \brief [12:12] Access Enable for Master TAG ID 12 (rw) */
    unsigned int EN13:1;                    /**< \brief [13:13] Access Enable for Master TAG ID 13 (rw) */
    unsigned int EN14:1;                    /**< \brief [14:14] Access Enable for Master TAG ID 14 (rw) */
    unsigned int EN15:1;                    /**< \brief [15:15] Access Enable for Master TAG ID 15 (rw) */
    unsigned int EN16:1;                    /**< \brief [16:16] Access Enable for Master TAG ID 16 (rw) */
    unsigned int EN17:1;                    /**< \brief [17:17] Access Enable for Master TAG ID 17 (rw) */
    unsigned int EN18:1;                    /**< \brief [18:18] Access Enable for Master TAG ID 18 (rw) */
    unsigned int EN19:1;                    /**< \brief [19:19] Access Enable for Master TAG ID 19 (rw) */
    unsigned int EN20:1;                    /**< \brief [20:20] Access Enable for Master TAG ID 20 (rw) */
    unsigned int EN21:1;                    /**< \brief [21:21] Access Enable for Master TAG ID 21 (rw) */
    unsigned int EN22:1;                    /**< \brief [22:22] Access Enable for Master TAG ID 22 (rw) */
    unsigned int EN23:1;                    /**< \brief [23:23] Access Enable for Master TAG ID 23 (rw) */
    unsigned int EN24:1;                    /**< \brief [24:24] Access Enable for Master TAG ID 24 (rw) */
    unsigned int EN25:1;                    /**< \brief [25:25] Access Enable for Master TAG ID 25 (rw) */
    unsigned int EN26:1;                    /**< \brief [26:26] Access Enable for Master TAG ID 26 (rw) */
    unsigned int EN27:1;                    /**< \brief [27:27] Access Enable for Master TAG ID 27 (rw) */
    unsigned int EN28:1;                    /**< \brief [28:28] Access Enable for Master TAG ID 28 (rw) */
    unsigned int EN29:1;                    /**< \brief [29:29] Access Enable for Master TAG ID 29 (rw) */
    unsigned int EN30:1;                    /**< \brief [30:30] Access Enable for Master TAG ID 30 (rw) */
    unsigned int EN31:1;                    /**< \brief [31:31] Access Enable for Master TAG ID 31 (rw) */
} Ifx_PSI5S_ACCEN0_Bits;

/** \brief  Access Enable Register 1 */
typedef struct _Ifx_PSI5S_ACCEN1_Bits
{
    unsigned int reserved_0:32;             /**< \brief \internal Reserved */
} Ifx_PSI5S_ACCEN1_Bits;

/** \brief  Base Address Register */
typedef struct _Ifx_PSI5S_BAR_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int BA:30;                     /**< \brief [31:2] Base Address (rw) */
} Ifx_PSI5S_BAR_Bits;

/** \brief  Baud Rate Timer/Reload Register */
typedef struct _Ifx_PSI5S_BG_Bits
{
    unsigned int BR_VALUE:13;               /**< \brief [12:0] Baud Rate Timer/Reload Register Value (rwh) */
    unsigned int reserved_13:19;            /**< \brief \internal Reserved */
} Ifx_PSI5S_BG_Bits;

/** \brief  CPU Direct Write Register */
typedef struct _Ifx_PSI5S_CDW_Bits
{
    unsigned int SD0:1;                     /**< \brief [0:0] SD0 (rw) */
    unsigned int SD1:1;                     /**< \brief [1:1] SD1 (rw) */
    unsigned int SD2:1;                     /**< \brief [2:2] SD2 (rw) */
    unsigned int SD3:1;                     /**< \brief [3:3] SD3 (rw) */
    unsigned int SD4:1;                     /**< \brief [4:4] SD4 (rw) */
    unsigned int SD5:1;                     /**< \brief [5:5] SD5 (rw) */
    unsigned int SD6:1;                     /**< \brief [6:6] SD6 (rw) */
    unsigned int SD7:1;                     /**< \brief [7:7] SD7 (rw) */
    unsigned int TSI:1;                     /**< \brief [8:8] Trigger Pulse Indicator (rw) */
    unsigned int reserved_9:23;             /**< \brief \internal Reserved */
} Ifx_PSI5S_CDW_Bits;

/** \brief  Clock Control Register */
typedef struct _Ifx_PSI5S_CLC_Bits
{
    unsigned int DISR:1;                    /**< \brief [0:0] Module Disable Request Bit (rw) */
    unsigned int DISS:1;                    /**< \brief [1:1] Module Disable Status Bit (rh) */
    unsigned int reserved_2:1;              /**< \brief \internal Reserved */
    unsigned int EDIS:1;                    /**< \brief [3:3] External Sleep Mode Request Disable Bit (rw) */
    unsigned int reserved_4:28;             /**< \brief \internal Reserved */
} Ifx_PSI5S_CLC_Bits;

/** \brief  Control Register */
typedef struct _Ifx_PSI5S_CON_Bits
{
    unsigned int M:3;                       /**< \brief [2:0] Mode Selection (rw) */
    unsigned int STP:1;                     /**< \brief [3:3] Number of Stop Bit Selection (rw) */
    unsigned int REN:1;                     /**< \brief [4:4] Receiver Enable Control (r) */
    unsigned int PEN:1;                     /**< \brief [5:5] Parity Check Enable (asynchronous mode only) (rw) */
    unsigned int FEN:1;                     /**< \brief [6:6] Framing Check Enable (asynchronous mode only) (rw) */
    unsigned int OEN:1;                     /**< \brief [7:7] Overrun Check Enable (rw) */
    unsigned int PE:1;                      /**< \brief [8:8] ASC Parity Error Flag (r) */
    unsigned int FE:1;                      /**< \brief [9:9] ASC Framing Error Flag (r) */
    unsigned int OE:1;                      /**< \brief [10:10] ASC Overrun Error Flag (r) */
    unsigned int FDE:1;                     /**< \brief [11:11] Fractional Divider Enable (rw) */
    unsigned int ODD:1;                     /**< \brief [12:12] Parity Selection (rw) */
    unsigned int BRS:1;                     /**< \brief [13:13] Baud Rate Selection (rw) */
    unsigned int LB:1;                      /**< \brief [14:14] Loop-back Mode Enable (rw) */
    unsigned int R:1;                       /**< \brief [15:15] Baud Rate Generator Run Control (rw) */
    unsigned int MTX:3;                     /**< \brief [18:16] Mode Selection TX direction (rw) */
    unsigned int reserved_19:9;             /**< \brief \internal Reserved */
    unsigned int ODDTX:1;                   /**< \brief [28:28] Parity Selection TX direction (rw) */
    unsigned int reserved_29:3;             /**< \brief \internal Reserved */
} Ifx_PSI5S_CON_Bits;

