luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxPsi5s_regdef.h
/** \brief  Interrupt Clear Register */
typedef struct _Ifx_PSI5S_INTCLR_Bits
{
    unsigned int RSI:1;                     /**< \brief [0:0] Clear Interrupt Request Flag RSI (w) */
    unsigned int RDI:1;                     /**< \brief [1:1] Clear Interrupt Request Flag RDI (w) */
    unsigned int RBI:1;                     /**< \brief [2:2] Clear Interrupt Request Flag RBI (w) */
    unsigned int TEI:1;                     /**< \brief [3:3] Clear Interrupt Request Flag TEI (w) */
    unsigned int CHCI:1;                    /**< \brief [4:4] Clear Interrupt Request Flag CHCI (w) */
    unsigned int CRCI:1;                    /**< \brief [5:5] Clear Interrupt Request Flag CRCI (w) */
    unsigned int TPI:1;                     /**< \brief [6:6] Clear Interrupt Request Flag TPI (w) */
    unsigned int TPOI:1;                    /**< \brief [7:7] Clear Interrupt Request Flag TPOI (w) */
    unsigned int HDI:1;                     /**< \brief [8:8] Clear Interrupt Request Flag HDI (w) */
    unsigned int reserved_9:23;             /**< \brief \internal Reserved */
} Ifx_PSI5S_INTCLR_Bits;

/** \brief  Interrupt Clear Register G */
typedef struct _Ifx_PSI5S_INTCLRG_Bits
{
    unsigned int TIR:1;                     /**< \brief [0:0] Clear Interrupt Request Flag TIR (w) */
    unsigned int RIR:1;                     /**< \brief [1:1] Clear Interrupt Request Flag RIR (w) */
    unsigned int EIR:1;                     /**< \brief [2:2] Clear Interrupt Request Flag EIR (w) */
    unsigned int TBIR:1;                    /**< \brief [3:3] Clear Interrupt Request Flag TBIR (w) */
    unsigned int XCRCI:1;                   /**< \brief [4:4] Clear Interrupt Request Flag XCRCI (w) */
    unsigned int FOI:1;                     /**< \brief [5:5] Clear Interrupt Request Flag FOI (w) */
    unsigned int reserved_6:26;             /**< \brief \internal Reserved */
} Ifx_PSI5S_INTCLRG_Bits;

/** \brief  Interrupt Enable Register */
typedef struct _Ifx_PSI5S_INTEN_Bits
{
    unsigned int RSI:1;                     /**< \brief [0:0] Enable Interrupt Request RSI (rw) */
    unsigned int RDI:1;                     /**< \brief [1:1] Enable Interrupt Request RDI (rw) */
    unsigned int RBI:1;                     /**< \brief [2:2] Enable Interrupt Request RBI (rw) */
    unsigned int TEI:1;                     /**< \brief [3:3] Enable Interrupt Request TEI (rw) */
    unsigned int CHCI:1;                    /**< \brief [4:4] Enable Interrupt Request CHCI (rw) */
    unsigned int CRCI:1;                    /**< \brief [5:5] Enable Interrupt Request CRCI (rw) */
    unsigned int TPI:1;                     /**< \brief [6:6] Enable Interrupt Request TPI (rw) */
    unsigned int TPOI:1;                    /**< \brief [7:7] Enable Interrupt Request TPOI (rw) */
    unsigned int HDI:1;                     /**< \brief [8:8] Enable Interrupt Request HDI (rw) */
    unsigned int reserved_9:23;             /**< \brief \internal Reserved */
} Ifx_PSI5S_INTEN_Bits;

/** \brief  Interrupt Enable Register G */
typedef struct _Ifx_PSI5S_INTENG_Bits
{
    unsigned int TIR:1;                     /**< \brief [0:0] Enable Interrupt Request TIR (rw) */
    unsigned int RIR:1;                     /**< \brief [1:1] Enable Interrupt Request RIR (rw) */
    unsigned int EIR:1;                     /**< \brief [2:2] Enable Interrupt Request EIR (rw) */
    unsigned int TBIR:1;                    /**< \brief [3:3] Enable Interrupt Request TBIR (rw) */
    unsigned int XCRCI:1;                   /**< \brief [4:4] Enable Interrupt Request XCRCI (rw) */
    unsigned int FOI:1;                     /**< \brief [5:5] Enable Interrupt Request FOI (rw) */
    unsigned int reserved_6:26;             /**< \brief \internal Reserved */
} Ifx_PSI5S_INTENG_Bits;

/** \brief  Interrupt Overview Register */
typedef struct _Ifx_PSI5S_INTOV_Bits
{
    unsigned int RSI:1;                     /**< \brief [0:0] Interrupt Pending on Node Pointer RSI (rh) */
    unsigned int RDI:1;                     /**< \brief [1:1] Interrupt Pending on Node Pointer RDI (rh) */
    unsigned int RBI:1;                     /**< \brief [2:2] Interrupt Pending on Node Pointer RBI (rh) */
    unsigned int TEI:1;                     /**< \brief [3:3] Interrupt Pending on Node Pointer TEI (rh) */
    unsigned int CHCI:1;                    /**< \brief [4:4] Interrupt Pending on Node Pointer CHCI (rh) */
    unsigned int CRCI:1;                    /**< \brief [5:5] Interrupt Pending on Node Pointer CRCI (rh) */
    unsigned int TPI:1;                     /**< \brief [6:6] Interrupt Pending on Node Pointer TPI (rh) */
    unsigned int TPOI:1;                    /**< \brief [7:7] Interrupt Pending on Node Pointer TPOI (rh) */
    unsigned int HDI:1;                     /**< \brief [8:8] Interrupt Pending on Node Pointer HDI (rh) */
    unsigned int TIR:1;                     /**< \brief [9:9] Interrupt Pending on Node Pointer TIR (rh) */
    unsigned int RIR:1;                     /**< \brief [10:10] Interrupt Pending on Node Pointer RIR (rh) */
    unsigned int EIR:1;                     /**< \brief [11:11] Interrupt Pending on Node Pointer EIR (rh) */
    unsigned int TBIR:1;                    /**< \brief [12:12] Interrupt Pending on Node Pointer TBIR (rh) */
    unsigned int XCRCI:1;                   /**< \brief [13:13] Interrupt Pending on Node Pointer XCRCI (rh) */
    unsigned int FOI:1;                     /**< \brief [14:14] Interrupt Pending on Node Pointer FOI (rh) */
    unsigned int reserved_15:17;            /**< \brief \internal Reserved */
} Ifx_PSI5S_INTOV_Bits;

/** \brief  Interrupt Set Register */
typedef struct _Ifx_PSI5S_INTSET_Bits
{
    unsigned int RSI:1;                     /**< \brief [0:0] Set Interrupt Request Flag RSI (w) */
    unsigned int RDI:1;                     /**< \brief [1:1] Set Interrupt Request Flag RDI (w) */
    unsigned int RBI:1;                     /**< \brief [2:2] Set Interrupt Request Flag RBI (w) */
    unsigned int TEI:1;                     /**< \brief [3:3] Set Interrupt Request Flag TEI (w) */
    unsigned int CHCI:1;                    /**< \brief [4:4] Set Interrupt Request Flag CHCI (w) */
    unsigned int CRCI:1;                    /**< \brief [5:5] Set Interrupt Request Flag CRCI (w) */
    unsigned int TPI:1;                     /**< \brief [6:6] Set Interrupt Request Flag TPI (w) */
    unsigned int TPOI:1;                    /**< \brief [7:7] Set Interrupt Request Flag TPOI (w) */
    unsigned int HDI:1;                     /**< \brief [8:8] Set Interrupt Request Flag HDI (w) */
    unsigned int reserved_9:23;             /**< \brief \internal Reserved */
} Ifx_PSI5S_INTSET_Bits;

/** \brief  Interrupt Set Register G */
typedef struct _Ifx_PSI5S_INTSETG_Bits
{
    unsigned int TIR:1;                     /**< \brief [0:0] Set Interrupt Request Flag TIR (w) */
    unsigned int RIR:1;                     /**< \brief [1:1] Set Interrupt Request Flag RIR (w) */
    unsigned int EIR:1;                     /**< \brief [2:2] Set Interrupt Request Flag EIR (w) */
    unsigned int TBIR:1;                    /**< \brief [3:3] Set Interrupt Request Flag TBIR (w) */
    unsigned int XCRCI:1;                   /**< \brief [4:4] Set Interrupt Request Flag XCRCI (w) */
    unsigned int FOI:1;                     /**< \brief [5:5] Set Interrupt Request Flag FOI (w) */
    unsigned int reserved_6:26;             /**< \brief \internal Reserved */
} Ifx_PSI5S_INTSETG_Bits;

/** \brief  Interrupt Status Register */
typedef struct _Ifx_PSI5S_INTSTAT_Bits
{
    unsigned int RSI:1;                     /**< \brief [0:0] Receive Success Interrupt Request Flag (rh) */
    unsigned int RDI:1;                     /**< \brief [1:1] Receive Data Interrupt Request Flag (rh) */
    unsigned int RBI:1;                     /**< \brief [2:2] Receive Buffer Overflow Interrupt Request Flag (rh) */
    unsigned int TEI:1;                     /**< \brief [3:3] Timing Error Interrupt Request Flag (rh) */
    unsigned int CHCI:1;                    /**< \brief [4:4] Channel Completed Interrupt Request Flag (rh) */
    unsigned int CRCI:1;                    /**< \brief [5:5] CRC Error Request Flag (rh) */
    unsigned int TPI:1;                     /**< \brief [6:6] Transfer Preparation Interrupt Request Flag (rh) */
    unsigned int TPOI:1;                    /**< \brief [7:7] Transmit Preparation Overflow Interrupt Request Flag (rh) */
    unsigned int HDI:1;                     /**< \brief [8:8] Header Error Signalled Flag (rh) */
    unsigned int reserved_9:23;             /**< \brief \internal Reserved */
} Ifx_PSI5S_INTSTAT_Bits;

/** \brief  Interrupt Status Register G */
typedef struct _Ifx_PSI5S_INTSTATG_Bits
{
    unsigned int TIR:1;                     /**< \brief [0:0] Transmit Interrupt Request Flag (rh) */
    unsigned int RIR:1;                     /**< \brief [1:1] Receive Interrupt Request Flag (rh) */
    unsigned int EIR:1;                     /**< \brief [2:2] Error Interrupt Request Flag (rh) */
    unsigned int TBIR:1;                    /**< \brief [3:3] Transmit Buffer Interrupt Request Flag (rh) */
    unsigned int XCRCI:1;                   /**< \brief [4:4] XCRC Error Request Flag (rh) */
    unsigned int FOI:1;                     /**< \brief [5:5] FIFO Error Request Flag (rh) */
    unsigned int reserved_6:26;             /**< \brief \internal Reserved */
} Ifx_PSI5S_INTSTATG_Bits;

/** \brief  Input and Output Control Register */
typedef struct _Ifx_PSI5S_IOCR_Bits
{
    unsigned int ALTI:2;                    /**< \brief [1:0] Alternate Input Select (rw) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_PSI5S_IOCR_Bits;

/** \brief  Kernel Reset Register 0 */
typedef struct _Ifx_PSI5S_KRST0_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int RSTSTAT:1;                 /**< \brief [1:1] Kernel Reset Status (rh) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_PSI5S_KRST0_Bits;

/** \brief  Kernel Reset Register 1 */
typedef struct _Ifx_PSI5S_KRST1_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_PSI5S_KRST1_Bits;

