luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxPsi5s_regdef.h
/** \brief  Receive Status Register */
typedef struct _Ifx_PSI5S_RDS_Bits
{
    unsigned int XCRC0:1;                   /**< \brief [0:0] XCRC (r) */
    unsigned int XCRC1:1;                   /**< \brief [1:1] XCRC (r) */
    unsigned int XCRC2:1;                   /**< \brief [2:2] XCRC (r) */
    unsigned int XCRC3:1;                   /**< \brief [3:3] XCRC (r) */
    unsigned int XCRC4:1;                   /**< \brief [4:4] XCRC (r) */
    unsigned int XCRC5:1;                   /**< \brief [5:5] XCRC (r) */
    unsigned int XCRCI:1;                   /**< \brief [6:6] XCRC Error Flag (r) */
    unsigned int CRC0:1;                    /**< \brief [7:7] CRC (r) */
    unsigned int CRC1:1;                    /**< \brief [8:8] CRC (r) */
    unsigned int CRC2:1;                    /**< \brief [9:9] CRC (r) */
    unsigned int CRCI:1;                    /**< \brief [10:10] CRC Error Flag (r) */
    unsigned int ERR0:1;                    /**< \brief [11:11] Error signalling Flag 0 (r) */
    unsigned int ERR1:1;                    /**< \brief [12:12] Error signalling Flag 1 (r) */
    unsigned int HDI:1;                     /**< \brief [13:13] Header Error Signalled Flag (r) */
    unsigned int PE:1;                      /**< \brief [14:14] ASC Parity Error Flag (r) */
    unsigned int FE:1;                      /**< \brief [15:15] ASC Framing Error Flag (r) */
    unsigned int OE:1;                      /**< \brief [16:16] ASC Overrun Error Flag (r) */
    unsigned int TEI:1;                     /**< \brief [17:17] Time Error Flag (r) */
    unsigned int RBI:1;                     /**< \brief [18:18] Receive Buffer Overflow Flag (r) */
    unsigned int FID:3;                     /**< \brief [21:19] Frame ID (Frame Number) (r) */
    unsigned int CID:3;                     /**< \brief [24:22] Channel ID (Channel Number) (r) */
    unsigned int AFC:3;                     /**< \brief [27:25] Actual UART Frame Count (r) */
    unsigned int PFC:4;                     /**< \brief [31:28] Packet Frame Count (r) */
} Ifx_PSI5S_RDS_Bits;

/** \brief  Send Control Register */
typedef struct _Ifx_PSI5S_SCR_Bits
{
    unsigned int PLL:5;                     /**< \brief [4:0] Pay Load Length of Registers SDRx (rw) */
    unsigned int reserved_5:1;              /**< \brief \internal Reserved */
    unsigned int EPS:2;                     /**< \brief [7:6] Enhanced Protocol Selection (rw) */
    unsigned int BSC:1;                     /**< \brief [8:8] Bit Stuffing Control (rw) */
    unsigned int reserved_9:5;              /**< \brief \internal Reserved */
    unsigned int FLUS:1;                    /**< \brief [14:14] Flush SDRx (w) */
    unsigned int reserved_15:7;             /**< \brief \internal Reserved */
    unsigned int CRC:1;                     /**< \brief [22:22] CRC Generation Control (rw) */
    unsigned int STA:1;                     /**< \brief [23:23] Start Sequence Generation Control (rw) */
    unsigned int reserved_24:2;             /**< \brief \internal Reserved */
    unsigned int TPF:1;                     /**< \brief [26:26] Transmit in Progress Flag (r) */
    unsigned int reserved_27:5;             /**< \brief \internal Reserved */
} Ifx_PSI5S_SCR_Bits;

/** \brief  Send Data Register */
typedef struct _Ifx_PSI5S_SDR_Bits
{
    unsigned int SD0:1;                     /**< \brief [0:0] SD0 (rw) */
    unsigned int SD1:1;                     /**< \brief [1:1] SD1 (rw) */
    unsigned int SD2:1;                     /**< \brief [2:2] SD2 (rw) */
    unsigned int SD3:1;                     /**< \brief [3:3] SD3 (rw) */
    unsigned int SD4:1;                     /**< \brief [4:4] SD4 (rw) */
    unsigned int SD5:1;                     /**< \brief [5:5] SD5 (rw) */
    unsigned int SD6:1;                     /**< \brief [6:6] SD6 (rw) */
    unsigned int SD7:1;                     /**< \brief [7:7] SD7 (rw) */
    unsigned int SD8:1;                     /**< \brief [8:8] SD8 (rw) */
    unsigned int SD9:1;                     /**< \brief [9:9] SD9 (rw) */
    unsigned int SD10:1;                    /**< \brief [10:10] SD10 (rw) */
    unsigned int SD11:1;                    /**< \brief [11:11] SD11 (rw) */
    unsigned int SD12:1;                    /**< \brief [12:12] SD12 (rw) */
    unsigned int SD13:1;                    /**< \brief [13:13] SD13 (rw) */
    unsigned int SD14:1;                    /**< \brief [14:14] SD14 (rw) */
    unsigned int SD15:1;                    /**< \brief [15:15] SD15 (rw) */
    unsigned int SD16:1;                    /**< \brief [16:16] SD16 (rw) */
    unsigned int SD17:1;                    /**< \brief [17:17] SD17 (rw) */
    unsigned int SD18:1;                    /**< \brief [18:18] SD18 (rw) */
    unsigned int SD19:1;                    /**< \brief [19:19] SD19 (rw) */
    unsigned int SD20:1;                    /**< \brief [20:20] SD20 (rw) */
    unsigned int SD21:1;                    /**< \brief [21:21] SD21 (rw) */
    unsigned int SD22:1;                    /**< \brief [22:22] SD22 (rw) */
    unsigned int SD23:1;                    /**< \brief [23:23] SD23 (rw) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_PSI5S_SDR_Bits;

/** \brief  Target Address Register */
typedef struct _Ifx_PSI5S_TAR_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int TA:30;                     /**< \brief [31:2] Target Address (r) */
} Ifx_PSI5S_TAR_Bits;

/** \brief  Transmit Buffer Register */
typedef struct _Ifx_PSI5S_TBUF_Bits
{
    unsigned int TD_VALUE:9;                /**< \brief [8:0] Transmit Data Register Value (rw) */
    unsigned int reserved_9:23;             /**< \brief \internal Reserved */
} Ifx_PSI5S_TBUF_Bits;

/** \brief  Time Stamp Count Register A */
typedef struct _Ifx_PSI5S_TSCNTA_Bits
{
    unsigned int CTS:24;                    /**< \brief [23:0] Current Time Stamp for the Module (r) */
    unsigned int ETB:3;                     /**< \brief [26:24] External Time Base Select (rw) */
    unsigned int TBS:1;                     /**< \brief [27:27] Time Base Select (rw) */
    unsigned int TBEA:1;                    /**< \brief [28:28] Time Base Enable TSCNTA (rw) */
    unsigned int TBEB:1;                    /**< \brief [29:29] Time Base Enable TSCNTB (rw) */
    unsigned int CLRA:1;                    /**< \brief [30:30] Clear Time Stamp Counter A (w) */
    unsigned int CLRB:1;                    /**< \brief [31:31] Clear Time Stamp Counter B (w) */
} Ifx_PSI5S_TSCNTA_Bits;

/** \brief  Time Stamp Count Register B */
typedef struct _Ifx_PSI5S_TSCNTB_Bits
{
    unsigned int CTS:24;                    /**< \brief [23:0] Current Time Stamp for the Module (r) */
    unsigned int ETB:3;                     /**< \brief [26:24] External Time Base Select (rw) */
    unsigned int TBS:1;                     /**< \brief [27:27] Time Base Select (rw) */
    unsigned int reserved_28:4;             /**< \brief \internal Reserved */
} Ifx_PSI5S_TSCNTB_Bits;

/** \brief  Capture Register */
typedef struct _Ifx_PSI5S_TSCR_Bits
{
    unsigned int TS:24;                     /**< \brief [23:0] Time Stamp (r) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_PSI5S_TSCR_Bits;

/** \brief  Time Stamp Mirror Register TSM */
typedef struct _Ifx_PSI5S_TSM_Bits
{
    unsigned int TS:24;                     /**< \brief [23:0] Time Stamp (r) */
    unsigned int reserved_24:4;             /**< \brief \internal Reserved */
    unsigned int PFC:4;                     /**< \brief [31:28] Packet Frame Count (r) */
} Ifx_PSI5S_TSM_Bits;

/** \brief  Watch Dog Timer Register */
typedef struct _Ifx_PSI5S_WDT_Bits
{
    unsigned int WDL:24;                    /**< \brief [23:0] Watch Dog Timer Limit (rw) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_PSI5S_WDT_Bits;

