luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxPsi5s_regdef.h
/** \brief  Write Hardware Bits Control Register */
typedef struct _Ifx_PSI5S_WHBCON_Bits
{
    unsigned int reserved_0:4;              /**< \brief \internal Reserved */
    unsigned int CLRREN:1;                  /**< \brief [4:4] Clear Receiver Enable Bit (w) */
    unsigned int SETREN:1;                  /**< \brief [5:5] Set Receiver Enable Bit (w) */
    unsigned int reserved_6:2;              /**< \brief \internal Reserved */
    unsigned int CLRPE:1;                   /**< \brief [8:8] Clear Parity Error Flag (w) */
    unsigned int CLRFE:1;                   /**< \brief [9:9] Clear Framing Error Flag (w) */
    unsigned int CLROE:1;                   /**< \brief [10:10] Clear Overrun Error Flag (w) */
    unsigned int SETPE:1;                   /**< \brief [11:11] Set Parity Error Flag (w) */
    unsigned int SETFE:1;                   /**< \brief [12:12] Set Framing Error Flag (w) */
    unsigned int SETOE:1;                   /**< \brief [13:13] Set Overrun Error Flag (w) */
    unsigned int reserved_14:18;            /**< \brief \internal Reserved */
} Ifx_PSI5S_WHBCON_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Psi5s_union
 * \{  */

/** \brief  Access Enable Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5S_ACCEN0_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5S_ACCEN0;

/** \brief  Access Enable Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5S_ACCEN1_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5S_ACCEN1;

/** \brief  Base Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5S_BAR_Bits B;                   /**< \brief Bitfield access */
} Ifx_PSI5S_BAR;

/** \brief  Baud Rate Timer/Reload Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5S_BG_Bits B;                    /**< \brief Bitfield access */
} Ifx_PSI5S_BG;

/** \brief  CPU Direct Write Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5S_CDW_Bits B;                   /**< \brief Bitfield access */
} Ifx_PSI5S_CDW;

/** \brief  Clock Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5S_CLC_Bits B;                   /**< \brief Bitfield access */
} Ifx_PSI5S_CLC;

/** \brief  Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5S_CON_Bits B;                   /**< \brief Bitfield access */
} Ifx_PSI5S_CON;

/** \brief  Channel Trigger Value Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5S_CTV_Bits B;                   /**< \brief Bitfield access */
} Ifx_PSI5S_CTV;

/** \brief  Frame Counter Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5S_FCNT_Bits B;                  /**< \brief Bitfield access */
} Ifx_PSI5S_FCNT;

/** \brief  Fractional Divider for Output CLK Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5S_FDO_Bits B;                   /**< \brief Bitfield access */
} Ifx_PSI5S_FDO;

/** \brief  PSI5-S Fractional Divider Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5S_FDR_Bits B;                   /**< \brief Bitfield access */
} Ifx_PSI5S_FDR;

/** \brief  Fractional Divider Register for Time Stamp */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5S_FDRT_Bits B;                  /**< \brief Bitfield access */
} Ifx_PSI5S_FDRT;

/** \brief  Fractional Divider Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5S_FDV_Bits B;                   /**< \brief Bitfield access */
} Ifx_PSI5S_FDV;

/** \brief  Global Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5S_GCR_Bits B;                   /**< \brief Bitfield access */
} Ifx_PSI5S_GCR;

/** \brief  Module Identification Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5S_ID_Bits B;                    /**< \brief Bitfield access */
} Ifx_PSI5S_ID;

/** \brief  Interrupt Node Pointer Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5S_INP_Bits B;                   /**< \brief Bitfield access */
} Ifx_PSI5S_INP;

/** \brief  Interrupt Node Pointer G Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5S_INPG_Bits B;                  /**< \brief Bitfield access */
} Ifx_PSI5S_INPG;

