luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxPsi5s_regdef.h
/** \brief  Interrupt Clear Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5S_INTCLR_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5S_INTCLR;

/** \brief  Interrupt Clear Register G */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5S_INTCLRG_Bits B;               /**< \brief Bitfield access */
} Ifx_PSI5S_INTCLRG;

/** \brief  Interrupt Enable Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5S_INTEN_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5S_INTEN;

/** \brief  Interrupt Enable Register G */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5S_INTENG_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5S_INTENG;

/** \brief  Interrupt Overview Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5S_INTOV_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5S_INTOV;

/** \brief  Interrupt Set Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5S_INTSET_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5S_INTSET;

/** \brief  Interrupt Set Register G */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5S_INTSETG_Bits B;               /**< \brief Bitfield access */
} Ifx_PSI5S_INTSETG;

/** \brief  Interrupt Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5S_INTSTAT_Bits B;               /**< \brief Bitfield access */
} Ifx_PSI5S_INTSTAT;

/** \brief  Interrupt Status Register G */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5S_INTSTATG_Bits B;              /**< \brief Bitfield access */
} Ifx_PSI5S_INTSTATG;

/** \brief  Input and Output Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5S_IOCR_Bits B;                  /**< \brief Bitfield access */
} Ifx_PSI5S_IOCR;

/** \brief  Kernel Reset Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5S_KRST0_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5S_KRST0;

/** \brief  Kernel Reset Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5S_KRST1_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5S_KRST1;

/** \brief  Kernel Reset Status Clear Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5S_KRSTCLR_Bits B;               /**< \brief Bitfield access */
} Ifx_PSI5S_KRSTCLR;

/** \brief  Number of Frames Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5S_NFC_Bits B;                   /**< \brief Bitfield access */
} Ifx_PSI5S_NFC;

/** \brief  OCDS Control and Status */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5S_OCS_Bits B;                   /**< \brief Bitfield access */
} Ifx_PSI5S_OCS;

/** \brief  Pulse Generation Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5S_PGC_Bits B;                   /**< \brief Bitfield access */
} Ifx_PSI5S_PGC;

/** \brief  Receive Buffer Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5S_RBUF_Bits B;                  /**< \brief Bitfield access */
} Ifx_PSI5S_RBUF;

/** \brief  Receiver Control Register A */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5S_RCRA_Bits B;                  /**< \brief Bitfield access */
} Ifx_PSI5S_RCRA;

/** \brief  Receiver Control Register B */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5S_RCRB_Bits B;                  /**< \brief Bitfield access */
} Ifx_PSI5S_RCRB;

/** \brief  Receive Data Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5S_RDR_Bits B;                   /**< \brief Bitfield access */
} Ifx_PSI5S_RDR;

